{
  "architectures": [
    "CustomTransformer"
  ],
  "model_type": "transformer",
  "d_model": 512,
  "num_encoder_layers": 6,
  "num_decoder_layers": 6,
  "num_attention_heads": 8,
  "hidden_size": 2048,
  "activation_function": "relu",
  "dropout": 0.1,
  "attention_dropout": 0.1,
  "activation_dropout": 0.1,
  "max_position_embeddings": 350,
  "vocab_size": 30522,
  "pad_token_id": 1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "is_encoder_decoder": true,
  "src_lang": "en",
  "tgt_lang": "hi"
}